//--------------------------------------------------------------------
#ifndef _SoStringHelp_h_
#define _SoStringHelp_h_
//--------------------------------------------------------------------
class SoStringHelp
{
public:
	//路径字符串标准化
	//把传入的字符串修改成如下格式：
	//1，把'\\'修改成'/'；
	//2，把大写字母修改成小写字母；
	//返回值是一个全局的字符串数组，外界要尽快将返回值取走。
	static const char* PathNormalize(const char* pszString);

};
//--------------------------------------------------------------------
#endif //_SoStringHelp_h_
//--------------------------------------------------------------------
